ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/8A8R-S/pins_arduino.h
/*******************************************************************************
 *  pins_arduino.h  ―  MPINO-8A8R-S  (㈜아이로직스 / ILOGICS)
 *  -----------------------------------------------------------------------------
 *  대상 보드 : MPINO-8A8R-S  (산업용 Arduino 호환 PLC)
 *  MCU       : ATmega128-AU  (64-pin TQFP, 16 MHz, MegaCore)
 *
 *  본 파일은 MegaCore (ATmega128) 환경에서 컴파일됩니다.
 *  https://github.com/MCUdude/MegaCore
 *
 *  ┌─────────────────────────────────────────────────────────────────────────┐
 *  │  보드 자원 (사용설명서 기준)                                                  │
 *  ├─────────────────────────────────────────────────────────────────────────┤
 *  │  ▸ 디지털 입력 (포토커플러 절연)    8점  : I(0)~I(7)  → D0~D7              │
 *  │  ▸ 릴레이 출력 (기계식 절연)        8점  : R(32)~R(39) → D32~D39           │
 *  │  ▸ 아날로그 입력 (0~5V/4~20mA/0~10V) 4점 : A0~A3      → D48~D51           │
 *  │  ▸ NTC 온도센서 입력               2점  : A4, A5     → D52, D53           │
 *  │  ▸ PWM 출력                       6점  : D21~D23 (TIMER3)                │
 *  │                                            D26~D28 (TIMER1)               │
 *  │  ▸ 외부 인터럽트 / 엔코더 입력      4점  : D18(SCL), D19(SDA),              │
 *  │                                            D24(CLK), D25(DIO)             │
 *  │  ▸ I²C 마스터/슬레이브 (1ch)             : D18(SCL), D19(SDA)              │
 *  │  ▸ RS-485 (Serial1, Modbus RTU)         : D30(RX1), D31(TX1)              │
 *  │  ▸ 선택 스위치                     2점  : D8(S1), D9(S2)                  │
 *  │  ▸ 상태 표시 LED (STATUS)               : D20 (LED_BUILTIN)               │
 *  │  ▸ 다운로드 포트 (Serial, USART0)         : D16(RX0), D17(TX0)              │
 *  └─────────────────────────────────────────────────────────────────────────┘
 *
 *  사용 안내 :
 *      ▸ 아날로그 기준전압은 REF3025(+2.5V)가 AREF 핀에 인가됩니다.
 *        setup() 안에 `analogReference(EXTERNAL);` 를 반드시 호출하십시오.
 *      ▸ SPI 핀(PB0~PB3)은 ISP 다운로드 헤더 전용으로,
 *        사용자 응용에서 SPI 디바이스 연결은 불가능합니다.
 *      ▸ D30(INT2)/D31(INT3) 은 RS-485 Serial1 전용이며, 사용자가
 *        외부 인터럽트로 사용해서는 안 됩니다.
 ******************************************************************************/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define MEGACORE
#define MCUDUDE_MEGACORE
#define MPINO128

/* 사용 편의 매크로 ------------------------------------------------------------
 * 사용설명서 4페이지의 "엔코더 사용방법", "고속카운터" 예제에서
 *
 *     attachInterrupt(digitalPinToInterrupt(CLK), countFunc, RISING);
 *
 * 와 같이 CLK / DIO 식별자를 그대로 사용할 수 있도록 정의합니다.
 * --------------------------------------------------------------------------- */
#define CLK   24      /* 고속 입력 / 엔코더 A상 (INT6, 내장 4.7kΩ Pull-Down) */
#define DIO   25      /* 고속 입력 / 엔코더 B상 (INT7, 내장 4.7kΩ Pull-Down) */

/* 디지털 핀 개수 ------------------------------------------------------------ */
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN32__) \
|| defined(__AVR_AT90CAN64__) || defined(__AVR_AT90CAN128__)
  #define NUM_DIGITAL_PINS           (54)
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  #define NUM_DIGITAL_PINS           (55)
#endif

/* PWM 사용 가능 핀 ----------------------------------------------------------
 * 사용설명서 4p "PWM 고속펄스 출력" :
 *   - D21, D22, D23  →  TIMER3 (OC3A / OC3B / OC3C)
 *   - D26, D27, D28  →  TIMER1 (OC1A / OC1B / OC1C)
 *
 * 그 외 PWM 채널(OC0 등)은 단자대로 인출되지 않거나 ISP 헤더 전용이므로
 * 사용자 응용에서 PWM 으로 사용할 수 없습니다.
 *
 * (D12 = PB4 = OC0 은 컴파일러 지원을 위해 타이머 배열에 남아있지만,
 *  단자대 미인출이므로 실제로 사용할 수 없습니다.)
 * --------------------------------------------------------------------------- */
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__) || defined(__AVR_AT90CAN32__) \
|| defined(__AVR_AT90CAN64__) || defined(__AVR_AT90CAN128__)
  #define digitalPinHasPWM(p)      (((p) >= 3 && (p) <= 5) || ((p) >= 12 && (p) <= 15))
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  #define digitalPinHasPWM(p)      (((p) >= 3 && (p) <= 5) || ((p) >= 12 && (p) <= 15) || ((p) == 53))
#endif

/* 상태 표시 LED -------------------------------------------------------------
 * 사용설명서 2p "상태 LED" : LED_BUILTIN 변수명 또는 D20 핀 사용 가능.
 * 회로도 시트2 STATUS 신호 = PE2.
 *
 *     pinMode(LED_BUILTIN, OUTPUT);
 *     digitalWrite(LED_BUILTIN, HIGH);     // STATUS LED 점등
 * --------------------------------------------------------------------------- */
#define LED_BUILTIN   (20)
static const uint8_t LED = LED_BUILTIN;

/* 아날로그 입력 -------------------------------------------------------------
 * 회로도 시트5 ANALOG 단자대 :
 *   A0 = ADC0 (PF0)    A1 = ADC1 (PF1)
 *   A2 = ADC2 (PF2)    A3 = ADC3 (PF3)
 *   A4 = ADC4 (PF4)  ← NTEMP1 (NTC 10kΩ 3950)
 *   A5 = ADC5 (PF5)  ← NTEMP2 (NTC 10kΩ 3950)
 *
 *     analogReference(EXTERNAL);        // REF3025 +2.5V 기준
 *     int v = analogRead(A0);           // 0~5V 또는 0~20mA 입력
 *     int t = analogRead(A4);           // NTC 온도센서 (사용설명서 ntcRead 함수)
 * --------------------------------------------------------------------------- */
#define PIN_A0   (48)
#define PIN_A1   (49)
#define PIN_A2   (50)
#define PIN_A3   (51)
#define PIN_A4   (52)
#define PIN_A5   (53)
static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
static const uint8_t A3 = PIN_A3;
static const uint8_t A4 = PIN_A4;     /* NTC 온도센서 입력 */
static const uint8_t A5 = PIN_A5;     /* NTC 온도센서 입력 */

#define NUM_ANALOG_INPUTS          (7)
#define analogInputToDigitalPin(p) (((p) < 7) ? (p) + 48 : -1)
#define analogPinToChannel(p)      ((p) < NUM_ANALOG_INPUTS ? (p) : (p) >= 48 ? (p) - 48 : -1)

/* SPI 핀 정의 (ISP 헤더 전용 — 사용자 응용 SPI 사용 불가) ------------------
 * ATmega128 의 SPI 핀(PB0~PB3) 은 ISP 다운로드 헤더(J1) 에만 연결되어 있어,
 * 외부 SPI 디바이스 사용은 불가능합니다. Arduino 코어 컴파일 호환성을 위해
 * 핀 번호 매크로만 정의합니다.
 * --------------------------------------------------------------------------- */
#define PIN_SPI_SS    (47)
#define PIN_SPI_SCK   (26)
#define PIN_SPI_MOSI  (0)
#define PIN_SPI_MISO  (1)
static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t SCK  = PIN_SPI_SCK;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;

/* I²C 핀 정의 ----------------------------------------------------------------
 * 회로도 시트6 I2C 단자대 : SCL = PD0, SDA = PD1.
 * 보드에 내장 4.7kΩ Pull-Up 저항이 실장되어 있어 외부 저항이 필요 없습니다.
 *
 * 연결 가능 디바이스 (사용설명서 5p) :
 *   - DS3231 RTC 모듈
 *   - 1602(16x2), 2004(20x4) 캐릭터 LCD
 *   - 기타 I²C 디바이스 (1:N 통신 지원)
 *
 *     #include <Wire.h>
 *     Wire.begin();
 * --------------------------------------------------------------------------- */
#define PIN_WIRE_SCL  (18)
#define PIN_WIRE_SDA  (19)
static const uint8_t SCL = PIN_WIRE_SCL;
static const uint8_t SDA = PIN_WIRE_SDA;

/* 외부 인터럽트 -------------------------------------------------------------
 * 사용설명서 4p "인터럽트 (attachInterrupt)" :
 *   사용 가능 핀 = 18(SCL), 19(SDA), 24(CLK), 25(DIO)
 *
 *   D18 = PD0 = INT0   (I²C SCL, 내장 4.7kΩ Pull-Up)
 *   D19 = PD1 = INT1   (I²C SDA, 내장 4.7kΩ Pull-Up)
 *   D20 = PD2 = INT2   ※ RS-485(RXD1) 전용 - 사용자 사용 금지
 *   D21 = PD3 = INT3   ※ RS-485(TXD1) 전용 - 사용자 사용 금지
 *   D24 = PE6 = INT6   (CLK, 내장 4.7kΩ Pull-Down)
 *   D25 = PE7 = INT7   (DIO, 내장 4.7kΩ Pull-Down)
 *
 *     attachInterrupt(digitalPinToInterrupt(CLK), countFunc, RISING);
 * --------------------------------------------------------------------------- */
#define EXTERNAL_NUM_INTERRUPTS    (8)
#define digitalPinToInterrupt(p)   (((p) >= 18 && (p) <= 25) ? (p) - 18 : NOT_AN_INTERRUPT)

