ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/8A8R-S/pins_arduino.h
/* 핀 변경 인터럽트(PCINT) ---------------------------------------------------
 * ATmega1281/2561 환경에서만 PCINT 가 활성화됩니다. ATmega128 에서는 PCINT
 * 하드웨어가 없으므로 컴파일러 호환성을 위한 빈 매크로로만 존재합니다.
 * --------------------------------------------------------------------------- */
#if defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
#define digitalPinToPCICR(p)    ((((p) >= 8) && ((p) <= 15)) || ((p) == 0) ? (&PCICR) : ((uint8_t*)0))
#define digitalPinToPCICRbit(p) ((((p) >= 8) && ((p) <= 15)) ? 0 : ((((p) == 0)  ? 1 : 0)))
#define digitalPinToPCMSK(p)    ((((p) >= 8) && ((p) <= 15)) ? (&PCMSK0) : ((((p) == 0)  ? (&PCMSK1) : ((uint8_t*)0))))
#define digitalPinToPCMSKbit(p) ((((p) >= 8) && ((p) <= 15)) ? ((p) - 8) : (((p) ==  0) ? 1 : 0))
#endif

#ifdef ARDUINO_MAIN

/* 포트 → 레지스터 매핑 (ATmega128: PORTA ~ PORTG) -------------------------- */
const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,
  (uint16_t) &DDRA,
  (uint16_t) &DDRB,
  (uint16_t) &DDRC,
  (uint16_t) &DDRD,
  (uint16_t) &DDRE,
  (uint16_t) &DDRF,
  (uint16_t) &DDRG,
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,
  (uint16_t) &PORTA,
  (uint16_t) &PORTB,
  (uint16_t) &PORTC,
  (uint16_t) &PORTD,
  (uint16_t) &PORTE,
  (uint16_t) &PORTF,
  (uint16_t) &PORTG,
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PIN,
  (uint16_t) &PINA,
  (uint16_t) &PINB,
  (uint16_t) &PINC,
  (uint16_t) &PIND,
  (uint16_t) &PINE,
  (uint16_t) &PINF,
  (uint16_t) &PING,
};

/* =============================================================================
 *  디지털 핀 번호 → ATmega128 포트 매핑
 *  -----------------------------------------------------------------------------
 *  MPINO-8A8R-S 보드의 실제 회로 결선과 사용설명서를 그대로 반영한 매핑입니다.
 *
 *      D번호    | ATmega128       | 보드 단자 / 기능
 *      ---------+-----------------+----------------------------------------------
 *      D0~D7    | PD4 PD5 PD6 PD7 | 디지털 입력 I(0)~I(7) (TLP290-4 포토커플러 절연)
 *               | PG0 PG1 PC0 PC1 | (IN_P0x → 포토커플러 → P0x_1x → MCU GPIO)
 *      D8       | PF7             | 선택 스위치 S1
 *      D9       | PF6             | 선택 스위치 S2
 *      D10      | PB2             | (ISP MOSI 전용, 단자대 미인출)
 *      D11      | PB3             | (ISP MISO 전용, 단자대 미인출)
 *      D12      | PB4             | (OC0, 단자대 미인출)
 *      D13~D14  | PG3, PG4        | (예약, 미사용)
 *      D15      | PF5             | (예약, A5와 공유되어 사용 안 함)
 *      D16~D17  | PE0, PE1        | USART0 RX0 / TX0 (다운로드 포트, Serial)
 *      D18      | PD0             | I²C SCL / INT0
 *      D19      | PD1             | I²C SDA / INT1
 *      D20      | PE2             | STATUS LED (LED_BUILTIN)
 *      D21~D23  | PE3, PE4, PE5   | PWM21~23 출력 (OC3A / OC3B / OC3C)
 *      D24      | PE6             | CLK 입력 (INT6, T3 외부 클럭, Pull-Down)
 *      D25      | PE7             | DIO 입력 (INT7, Pull-Down)
 *      D26~D28  | PB5, PB6, PB7   | PWM26~28 출력 (OC1A / OC1B / OC1C)
 *      D29      | PB1             | (ISP SCK 전용, 단자대 미인출)
 *      D30      | PD2             | USART1 RX1 (RS-485 Serial1) / INT2
 *      D31      | PD3             | USART1 TX1 (RS-485 Serial1) / INT3
 *      D32~D37  | PC2~PC7         | 릴레이 출력 R(32)~R(37)
 *      D38      | PG2             | 릴레이 출력 R(38)
 *      D39      | PA7             | 릴레이 출력 R(39)
 *      D40~D45  | PA6~PA1         | (예약, 미사용)
 *      D46      | PB0             | (ISP SS 전용, 단자대 미인출)
 *      D47~D53  | PF0~PF5         | 아날로그 입력 A0~A3 + NTC A4, A5
 * ========================================================================== */

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  PD, /* D0  - PD4 - 디지털 입력 I(0)  (IN_P00 → 포토커플러 → P00_10) */
  PD, /* D1  - PD5 - 디지털 입력 I(1)  (IN_P01 → P01_11) */
  PD, /* D2  - PD6 - 디지털 입력 I(2)  (IN_P02 → P02_12) */
  PD, /* D3  - PD7 - 디지털 입력 I(3)  (IN_P03 → P03_13) */
  PG, /* D4  - PG0 - 디지털 입력 I(4)  (IN_P04 → P04_14) */
  PG, /* D5  - PG1 - 디지털 입력 I(5)  (IN_P05 → P05_15) */
  PC, /* D6  - PC0 - 디지털 입력 I(6)  (IN_P06 → P06_16) */
  PC, /* D7  - PC1 - 디지털 입력 I(7)  (IN_P07 → P07_17) */
  PF, /* D8  - PF7 - 선택 스위치 S1 */
  PF, /* D9  - PF6 - 선택 스위치 S2 */
  PB, /* D10 - PB2 - (ISP MOSI 전용, 단자대 미인출) */
  PB, /* D11 - PB3 - (ISP MISO 전용, 단자대 미인출) */
  PB, /* D12 - PB4 - (OC0, 단자대 미인출) */
  PG, /* D13 - PG3 - (예약, 미사용) */
  PG, /* D14 - PG4 - (예약, 미사용) */
  PF, /* D15 - PF5 - (예약, A5와 공유) */
  PE, /* D16 - PE0 - USART0 RX0 (다운로드 포트, Serial) */
  PE, /* D17 - PE1 - USART0 TX0 (다운로드 포트, Serial) */
  PD, /* D18 - PD0 - I²C SCL / INT0 */
  PD, /* D19 - PD1 - I²C SDA / INT1 */
  PE, /* D20 - PE2 - STATUS LED (LED_BUILTIN) */
  PE, /* D21 - PE3 - PWM21 출력 (OC3A) */
  PE, /* D22 - PE4 - PWM22 출력 (OC3B) */
  PE, /* D23 - PE5 - PWM23 출력 (OC3C) */
  PE, /* D24 - PE6 - CLK 입력 (INT6, T3 외부 클럭, Pull-Down) */
  PE, /* D25 - PE7 - DIO 입력 (INT7, Pull-Down) */
  PB, /* D26 - PB5 - PWM26 출력 (OC1A) */
  PB, /* D27 - PB6 - PWM27 출력 (OC1B) */
  PB, /* D28 - PB7 - PWM28 출력 (OC1C) */
  PB, /* D29 - PB1 - (ISP SCK 전용, 단자대 미인출) */
  PD, /* D30 - PD2 - USART1 RX1 (RS-485 Serial1) / INT2 */
  PD, /* D31 - PD3 - USART1 TX1 (RS-485 Serial1) / INT3 */
  PC, /* D32 - PC2 - 릴레이 출력 R(32) */
  PC, /* D33 - PC3 - 릴레이 출력 R(33) */
  PC, /* D34 - PC4 - 릴레이 출력 R(34) */
  PC, /* D35 - PC5 - 릴레이 출력 R(35) */
  PC, /* D36 - PC6 - 릴레이 출력 R(36) */
  PC, /* D37 - PC7 - 릴레이 출력 R(37) */
  PG, /* D38 - PG2 - 릴레이 출력 R(38) */
  PA, /* D39 - PA7 - 릴레이 출력 R(39) */
  PA, /* D40 - PA6 - (예약, 미사용) */
  PA, /* D41 - PA5 - (예약, 미사용) */
  PA, /* D42 - PA4 - (예약, 미사용) */
  PA, /* D43 - PA3 - (예약, 미사용) */
  PA, /* D44 - PA2 - (예약, 미사용) */
  PA, /* D45 - PA1 - (예약, 미사용) */
  PB, /* D46 - PB0 - (ISP SS 전용, 단자대 미인출) */
  PF, /* D47 - PF0 - 아날로그 입력 A0 (ADC0) */
  PF, /* D48 - PF0 - 아날로그 입력 A0 (PIN_A0 = D48) */
  PF, /* D49 - PF1 - 아날로그 입력 A1 */
  PF, /* D50 - PF2 - 아날로그 입력 A2 */
  PF, /* D51 - PF3 - 아날로그 입력 A3 */
  PF, /* D52 - PF4 - NTC 온도센서 A4 */
  PF, /* D53 - PF5 - NTC 온도센서 A5 */
#if defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  PG, /* D54 - PG5 - PWM (ATmega1281/2561 전용) */
#endif
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  _BV(4), /* D0  - PD4 - I(0) */
  _BV(5), /* D1  - PD5 - I(1) */
  _BV(6), /* D2  - PD6 - I(2) */
  _BV(7), /* D3  - PD7 - I(3) */
  _BV(0), /* D4  - PG0 - I(4) */
  _BV(1), /* D5  - PG1 - I(5) */
  _BV(0), /* D6  - PC0 - I(6) */
  _BV(1), /* D7  - PC1 - I(7) */
  _BV(7), /* D8  - PF7 - S1 */
  _BV(6), /* D9  - PF6 - S2 */
  _BV(2), /* D10 - PB2 - MOSI */
  _BV(3), /* D11 - PB3 - MISO */
  _BV(4), /* D12 - PB4 - OC0 */
  _BV(3), /* D13 - PG3 */
  _BV(4), /* D14 - PG4 */
  _BV(5), /* D15 - PF5 */
  _BV(0), /* D16 - PE0 - RXD0 (다운로드) */
  _BV(1), /* D17 - PE1 - TXD0 (다운로드) */
  _BV(0), /* D18 - PD0 - SCL / INT0 */
  _BV(1), /* D19 - PD1 - SDA / INT1 */
  _BV(2), /* D20 - PE2 - STATUS LED */
  _BV(3), /* D21 - PE3 - PWM21 (OC3A) */
  _BV(4), /* D22 - PE4 - PWM22 (OC3B) */
  _BV(5), /* D23 - PE5 - PWM23 (OC3C) */
  _BV(6), /* D24 - PE6 - CLK / INT6 / T3 */
  _BV(7), /* D25 - PE7 - DIO / INT7 */
  _BV(5), /* D26 - PB5 - PWM26 (OC1A) */
  _BV(6), /* D27 - PB6 - PWM27 (OC1B) */
  _BV(7), /* D28 - PB7 - PWM28 (OC1C) */
  _BV(1), /* D29 - PB1 - SCK */
  _BV(2), /* D30 - PD2 - RXD1 (RS-485) / INT2 */
  _BV(3), /* D31 - PD3 - TXD1 (RS-485) / INT3 */
  _BV(2), /* D32 - PC2 - R(32) */
  _BV(3), /* D33 - PC3 - R(33) */
  _BV(4), /* D34 - PC4 - R(34) */
  _BV(5), /* D35 - PC5 - R(35) */
  _BV(6), /* D36 - PC6 - R(36) */
  _BV(7), /* D37 - PC7 - R(37) */
  _BV(2), /* D38 - PG2 - R(38) */
  _BV(7), /* D39 - PA7 - R(39) */
  _BV(6), /* D40 - PA6 */
  _BV(5), /* D41 - PA5 */
  _BV(4), /* D42 - PA4 */
  _BV(3), /* D43 - PA3 */
  _BV(2), /* D44 - PA2 */
  _BV(1), /* D45 - PA1 */
  _BV(0), /* D46 - PB0 - SS */
  _BV(0), /* D47 - PF0 - A0 */
  _BV(0), /* D48 - PF0 - A0 (PIN_A0) */
  _BV(1), /* D49 - PF1 - A1 */
  _BV(2), /* D50 - PF2 - A2 */
  _BV(3), /* D51 - PF3 - A3 */
  _BV(4), /* D52 - PF4 - A4 NTEMP */
  _BV(5), /* D53 - PF5 - A5 NTEMP */
#if defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  _BV(5), /* D54 - PG5 - PWM (ATmega1281/2561 전용) */
#endif
};

