ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/8A8R-S/pins_arduino.h
/* =============================================================================
 *  디지털 핀 → 타이머 매핑 (analogWrite 동작용)
 *  -----------------------------------------------------------------------------
 *  사용설명서 4p "PWM 고속펄스 출력" 의 PWM 핀 매핑이 그대로 반영됩니다.
 *
 *     analogWrite(21, 127);     // → D21(PE3) 핀에 OC3A 로 PWM 출력
 *     analogWrite(26, 127);     // → D26(PB5) 핀에 OC1A 로 PWM 출력
 * ========================================================================== */
const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  NOT_ON_TIMER, /* D0  - PD4 */
  NOT_ON_TIMER, /* D1  - PD5 */
  NOT_ON_TIMER, /* D2  - PD6 */
  NOT_ON_TIMER, /* D3  - PD7 */
  NOT_ON_TIMER, /* D4  - PG0 */
  NOT_ON_TIMER, /* D5  - PG1 */
  NOT_ON_TIMER, /* D6  - PC0 */
  NOT_ON_TIMER, /* D7  - PC1 */
  NOT_ON_TIMER, /* D8  - PF7 (S1) */
  NOT_ON_TIMER, /* D9  - PF6 (S2) */
  NOT_ON_TIMER, /* D10 - PB2 */
  NOT_ON_TIMER, /* D11 - PB3 */
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__)
  TIMER0,       /* D12 - PB4 - OC0 (단자대 미인출이라 실사용 불가) */
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__) || defined(__AVR_AT90CAN32__) \
|| defined(__AVR_AT90CAN64__) || defined(__AVR_AT90CAN128__)
  TIMER2A,      /* D12 - PB4 - OC2A */
#endif
  NOT_ON_TIMER, /* D13 - PG3 */
  NOT_ON_TIMER, /* D14 - PG4 */
  NOT_ON_TIMER, /* D15 - PF5 */
  NOT_ON_TIMER, /* D16 - PE0 (RXD0) */
  NOT_ON_TIMER, /* D17 - PE1 (TXD0) */
  NOT_ON_TIMER, /* D18 - PD0 (SCL / INT0) */
  NOT_ON_TIMER, /* D19 - PD1 (SDA / INT1) */
  NOT_ON_TIMER, /* D20 - PE2 (STATUS LED) */
  TIMER3A,      /* D21 - PE3 - PWM21 출력 */
  TIMER3B,      /* D22 - PE4 - PWM22 출력 */
  TIMER3C,      /* D23 - PE5 - PWM23 출력 */
  NOT_ON_TIMER, /* D24 - PE6 (CLK 입력) */
  NOT_ON_TIMER, /* D25 - PE7 (DIO 입력) */
  TIMER1A,      /* D26 - PB5 - PWM26 출력 */
  TIMER1B,      /* D27 - PB6 - PWM27 출력 */
  TIMER1C,      /* D28 - PB7 - PWM28 출력 */
  NOT_ON_TIMER, /* D29 - PB1 (SCK) */
  NOT_ON_TIMER, /* D30 - PD2 (RXD1 / INT2) */
  NOT_ON_TIMER, /* D31 - PD3 (TXD1 / INT3) */
  NOT_ON_TIMER, /* D32 - PC2 - R(32) */
  NOT_ON_TIMER, /* D33 - PC3 - R(33) */
  NOT_ON_TIMER, /* D34 - PC4 - R(34) */
  NOT_ON_TIMER, /* D35 - PC5 - R(35) */
  NOT_ON_TIMER, /* D36 - PC6 - R(36) */
  NOT_ON_TIMER, /* D37 - PC7 - R(37) */
  NOT_ON_TIMER, /* D38 - PG2 - R(38) */
  NOT_ON_TIMER, /* D39 - PA7 - R(39) */
  NOT_ON_TIMER, /* D40 - PA6 */
  NOT_ON_TIMER, /* D41 - PA5 */
  NOT_ON_TIMER, /* D42 - PA4 */
  NOT_ON_TIMER, /* D43 - PA3 */
  NOT_ON_TIMER, /* D44 - PA2 */
  NOT_ON_TIMER, /* D45 - PA1 */
  NOT_ON_TIMER, /* D46 - PB0 */
  NOT_ON_TIMER, /* D47 - PF0 - A0 */
  NOT_ON_TIMER, /* D48 - PF0 - A0 */
  NOT_ON_TIMER, /* D49 - PF1 - A1 */
  NOT_ON_TIMER, /* D50 - PF2 - A2 */
  NOT_ON_TIMER, /* D51 - PF3 - A3 */
  NOT_ON_TIMER, /* D52 - PF4 - A4 NTEMP */
  NOT_ON_TIMER, /* D53 - PF5 - A5 NTEMP */
  NOT_ON_TIMER, /* D54 - PF6 (사용 안 함) */
#if defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  TIMER0B,      /* D55 - PG5 - PWM (ATmega1281/2561 전용) */
#endif
};

#endif  /* ARDUINO_MAIN */

/* =============================================================================
 *  Serial 포트 별칭
 *  -----------------------------------------------------------------------------
 *  Serial   : USART0 (다운로드 / 디버깅, D16=RX0, D17=TX0)
 *  Serial1  : USART1 (RS-485 Modbus RTU, D30=RX1, D31=TX1)
 *
 *     Serial.begin(9600);          // 다운로드 포트 디버깅
 *     Serial1.begin(9600);         // RS-485 Modbus RTU 통신
 *  ========================================================================== */
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial1

#endif  /* Pins_Arduino_h */
